app/controllers/blog_templates_controller.rb

SELECT "blog_templates".* FROM "blog_templates"
---
  def index
    @blog_templates = BlogTemplate.all

INSERT INTO "blog_templates" ("blog_title", "subject", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @blog_template = current_user.profile.blog_templates.build(blog_template_params)

    if @blog_template.save

UPDATE "blog_templates" SET "blog_title" = $1, "subject" = $2, "body" = $3, "updated_at" = $4 WHERE "blog_templates"."id" = $5  [["blog_title", "trying something new"], ["subject", "I hope this works"], ["body", "I am seriously curious if this will work oh boy!!!!"], ["updated_at", 2017-02-17 20:36:13 UTC], ["id", 1]]
---
  def update
    if @blog_template.update(blog_template_params)

DELETE FROM "blog_templates" WHERE "blog_templates"."id" = $1  [["id", 1]]
---
  def destroy
    @blog_template.destroy

SELECT  "blog_templates".* FROM "blog_templates" WHERE "blog_templates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_blog_template
    @blog_template = current_user.profile.blog_templates.find(params[:id])