app/controllers/profiles_controller.rb

  def create
    @profile = current_user.build_profile(profile_params)

    if @profile.save
---
INSERT INTO "profiles" ("username", "favorite_genre", "favorite_band", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "billdozer"], ["favorite_genre", "metal"], ["favorite_band", "killswitch engage"], ["created_at", 2017-02-17 14:54:15 UTC], ["updated_at", 2017-02-17 14:54:15 UTC]]

  def update
    if @profile.update(profile_params)
---
UPDATE "profiles" SET "username" = $1, "favorite_band" = $2, "favorite_genre" = $3, "updated_at" = $4 WHERE "profiles"."id" = $5  [["username", "wildbill"], ["favorite_band", ""], ["favorite_genre", ""], ["updated_at", 2017-02-17 16:35:29 UTC], ["id", 1]]

  def set_profile
    @profile = Profile.find_by(id: params[:id], user: current_user)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]